<?php
namespace application\controllers;
use application\core\Controller;
class MainController extends Controller {
    public $dataJSON;
    public function __construct($route)
    {
        parent::__construct($route);
        $this->dataJSON = json_decode(file_get_contents('php://input'), true);
    }
    public function dataArray(){
        return [
            'dist' => [
                1 => 'В городе',
                2 => 'В деревне'
            ],
            'dr' => '1992-12-20',
            'voz' => '27',
            'pol' => [
                '1' => 'муж',
                '2' => 'жен',
            ],
            'sem' => [
                1 => 'в браке в настоящее время',
                2 => 'в разводе',
                3 => 'вдовец / вдова',
                4 => 'гражданский брак / проживание с партнером',
                5 => 'в браке в настоящее время',
                6 => 'никогда не был(а) в браке',
                7 => 'раздельное проживание (официально не разведены)'
            ],
            'naci' => [
                1 => 'Армяне',
                2 => 'Немцы',
                4 => 'Русские',
                5 => 'Белорусы',
                6 => 'Казахи',
                7 => 'Евреи',
                8 => 'Азербайджанцы',
                9 => 'Удмурты',
                10 => 'Мордва',
                11 => 'Татары',
                12 => 'Башкиры',
                13 => 'Чуваши',
                14 => 'Буряты',
                15 => 'Украинцы',
                16 => 'Другие национальности',
                17 => 'Молдаване',
                18 => 'Киргизы',
                19 => 'Лезгины',
                20 => 'Таджики',
                21 => 'Эстонцы'
            ],
            'obr' => [
                1 => '4 - профессиональное училище',
                2 => '3 - средняя школа / закон.среднее / выше среднего',
                3 => '2 - начальная школа',
                4 => '5 - ВУЗ'
            ],

            'prof' => [
                1 => 'работники,  занятые в сфере обслуживания, торговые работники магазинов и рынков',
                2 => 'низкоквалифицированные работники',
                3 => 'техники и младшие специалисты',
                4 => 'дипломированные специалисты',
                5 => 'ведение домашнего хозяйства',
                6 => 'квалифицированные работники сельского хозяйства и рыболовного',
                7 => 'ремесленники и представители других отраслей промышленности',
                8 => 'представители   законодат.   органов   власти,  высокопостав. долж.лица и менеджеры',
                9 => 'вооруженные силы',
                10 => 'операторы и монтажники установок и машинного оборудования',
                11 => 'служащие'
            ],
            'rab' => [
                0 => 'Не работаю',
                1 => 'Работаю'
            ],
            'napen' => [
                0 => 'Нет',
                1 => 'Да'
            ],
            'badrab' => [
                0 => 'Нет',
                1 => 'Да'
            ],
            'smok' => [
                1 => 'Бросил(а)',
                2 => 'Курит',
                3 => 'Никогда не курил(а)',
                4 => 'Никогда не курил'
            ],
            'smok_time' => 0,
            'smok_count' => 0,
            'smok_let' => 0,
            'smok_stop' => 0,
            'alko' => [
                0 => 'нет',
                1 => 'употребляю в настоящее время',
                2 => 'никогда не употреблял',
                3 => 'ранее употреблял',
            ],
            'alko_voz' => 0,
            'alko_razmer' => 0,
            'alko_regu' => [
                0 => 'нет',
                1 => 'каждый день',
                2 => 'каждый месяц',
                3 => 'каждую неделю'
            ],
            'alko_por' => 0,
            'alko_let' => 0,
            'alko_stop' => 0,
        ];
    }
    public function indexAction() {


        $vars = [
            'users' => [],
            'pole' => $this->dataArray()
        ];

        $this->view->render('Главная страница', $vars );
	}
	public function resultAction(){
        $results = [];
        $value = $_POST;
        $json = json_encode($value);
        $result = exec( 'JSON='.$json.' python '.$_SERVER['DOCUMENT_ROOT'].'/test.py 2>&1');
        $this->view->message('success', $result);
    }

}